# CurtainOrStackedWallDisallowedForCrossSectionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CurtainOrStackedWallDisallowedForCrossSectionType Property
BuiltInFailures..::..WallFailures Class See Also
---
Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainOrStackedWallDisallowedForCrossSectionType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainOrStackedWallDisallowedForCrossSectionType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace